Revit 2027 API
EaveCutterType Enumeration
An enumerated type to store type of EaveCutter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum EaveCutterType
Public Enumeration EaveCutterType
public enum class EaveCutterType
type EaveCutterType
Members
Member name | Value | Description
PlumbCut | 33,615 | Plumb Cut type of Eave.
TwoCutPlumb | 33,619 | Two Cut Plumb type of Eave.
TwoCutSquare | 33,618 | Two Cut Square type of Eave.
See Also
Reference
Autodesk.Revit.DB Namespace